hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_ppi_regs.h
/*
 * Copyright (c) 2021-2025 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PPI_H
#define HPM_PPI_H

typedef struct {
    __RW uint32_t GLB_CFG;                     /* 0x0: glb_cfg */
    __RW uint32_t PAD_CFG;                     /* 0x4: pad_cfg */
    __R  uint8_t  RESERVED0[12];               /* 0x8 - 0x13: Reserved */
    __RW uint32_t CLKPIN_CFG;                  /* 0x14: clkpin_cfg */
    __RW uint32_t TM_CFG;                      /* 0x18: tm_cfg */
    __R  uint8_t  RESERVED1[4];                /* 0x1C - 0x1F: Reserved */
    __RW uint32_t IRQ_STS;                     /* 0x20: irq_sts */
    __RW uint32_t IRQ_EN;                      /* 0x24: irq_en */
    __R  uint8_t  RESERVED2[24];               /* 0x28 - 0x3F: Reserved */
    struct {
        __RW uint32_t CFG0;                    /* 0x40: cfg0 */
        __RW uint32_t CFG1;                    /* 0x44: cfg1 */
        __RW uint32_t CFG2;                    /* 0x48: cfg2 */
        __RW uint32_t CFG3;                    /* 0x4C: cfg3 */
        __RW uint32_t CFG4;                    /* 0x50: cfg4 */
        __R  uint8_t  RESERVED0[12];           /* 0x54 - 0x5F: Reserved */
    } CS[4];
    __R  uint8_t  RESERVED3[832];              /* 0xC0 - 0x3FF: Reserved */
    struct {
        __RW uint32_t CMD_CFG;                 /* 0x400: cmd_cfg */
        __RW uint32_t AD_CFG;                  /* 0x404: ad_cfg */
        __RW uint32_t CTRL_CFG;                /* 0x408: ctrl_cfg */
        __R  uint8_t  RESERVED0[4];            /* 0x40C - 0x40F: Reserved */
    } CMD[64];
} PPI_Type;


/* Bitfield definition for register: GLB_CFG */
/*
 * PAD_OUT_REG_ENJ (RW)
 *
 * 0:  register output, one cycle delay;
 * 1:  direct output， no delay but may have timing issue
 */
#define PPI_GLB_CFG_PAD_OUT_REG_ENJ_MASK (0x2U)
#define PPI_GLB_CFG_PAD_OUT_REG_ENJ_SHIFT (1U)
#define PPI_GLB_CFG_PAD_OUT_REG_ENJ_SET(x) (((uint32_t)(x) << PPI_GLB_CFG_PAD_OUT_REG_ENJ_SHIFT) & PPI_GLB_CFG_PAD_OUT_REG_ENJ_MASK)
#define PPI_GLB_CFG_PAD_OUT_REG_ENJ_GET(x) (((uint32_t)(x) & PPI_GLB_CFG_PAD_OUT_REG_ENJ_MASK) >> PPI_GLB_CFG_PAD_OUT_REG_ENJ_SHIFT)

/*
 * SOFT_RESET (RW)
 *
 * software reset
 */
#define PPI_GLB_CFG_SOFT_RESET_MASK (0x1U)
#define PPI_GLB_CFG_SOFT_RESET_SHIFT (0U)
#define PPI_GLB_CFG_SOFT_RESET_SET(x) (((uint32_t)(x) << PPI_GLB_CFG_SOFT_RESET_SHIFT) & PPI_GLB_CFG_SOFT_RESET_MASK)
#define PPI_GLB_CFG_SOFT_RESET_GET(x) (((uint32_t)(x) & PPI_GLB_CFG_SOFT_RESET_MASK) >> PPI_GLB_CFG_SOFT_RESET_SHIFT)

/* Bitfield definition for register: PAD_CFG */
/*
 * CS_IDLE_ST (RW)
 *
 * cs pin idle state, default high for active low
 */
#define PPI_PAD_CFG_CS_IDLE_ST_MASK (0xF000000UL)
#define PPI_PAD_CFG_CS_IDLE_ST_SHIFT (24U)
#define PPI_PAD_CFG_CS_IDLE_ST_SET(x) (((uint32_t)(x) << PPI_PAD_CFG_CS_IDLE_ST_SHIFT) & PPI_PAD_CFG_CS_IDLE_ST_MASK)
#define PPI_PAD_CFG_CS_IDLE_ST_GET(x) (((uint32_t)(x) & PPI_PAD_CFG_CS_IDLE_ST_MASK) >> PPI_PAD_CFG_CS_IDLE_ST_SHIFT)

/*
 * CTRL_PAD_OE (RW)
 *
 * the pad output enable signal. 0 for IN; 1 for OUT.
 * NOTE: for unused pads, set both ctrl_pad_oe and ctrl_pad_pol to 0
 */
#define PPI_PAD_CFG_CTRL_PAD_OE_MASK (0xFF00U)
#define PPI_PAD_CFG_CTRL_PAD_OE_SHIFT (8U)
#define PPI_PAD_CFG_CTRL_PAD_OE_SET(x) (((uint32_t)(x) << PPI_PAD_CFG_CTRL_PAD_OE_SHIFT) & PPI_PAD_CFG_CTRL_PAD_OE_MASK)
#define PPI_PAD_CFG_CTRL_PAD_OE_GET(x) (((uint32_t)(x) & PPI_PAD_CFG_CTRL_PAD_OE_MASK) >> PPI_PAD_CFG_CTRL_PAD_OE_SHIFT)

/*
 * CTRL_PAD_POL (RW)
 *
 * for OUT pad:
 * 0: output the value in cmd
 * 1: output reversed value in cmd
 * for IN pad, defines the signal active value,  when ctrl_cfg.io_cfg is set,
 * will wait the active value for ready(generally read or write ready)
 */
#define PPI_PAD_CFG_CTRL_PAD_POL_MASK (0xFFU)
#define PPI_PAD_CFG_CTRL_PAD_POL_SHIFT (0U)
#define PPI_PAD_CFG_CTRL_PAD_POL_SET(x) (((uint32_t)(x) << PPI_PAD_CFG_CTRL_PAD_POL_SHIFT) & PPI_PAD_CFG_CTRL_PAD_POL_MASK)
#define PPI_PAD_CFG_CTRL_PAD_POL_GET(x) (((uint32_t)(x) & PPI_PAD_CFG_CTRL_PAD_POL_MASK) >> PPI_PAD_CFG_CTRL_PAD_POL_SHIFT)

/* Bitfield definition for register: CLKPIN_CFG */
/*
 * CYCLE (RW)
 *
 * there will be a system counter run from 0 to cycle,
 * clk output will be set to high when counter is clk_high, and low when counter is clk_low.
 * The output will be system clock if cycle is 0.
 * All 4 CS share same clock configuration(one clock pin with configured frequency).
 * different CS can be assert at different  counter value.
 */
#define PPI_CLKPIN_CFG_CYCLE_MASK (0xF000000UL)
#define PPI_CLKPIN_CFG_CYCLE_SHIFT (24U)
#define PPI_CLKPIN_CFG_CYCLE_SET(x) (((uint32_t)(x) << PPI_CLKPIN_CFG_CYCLE_SHIFT) & PPI_CLKPIN_CFG_CYCLE_MASK)
#define PPI_CLKPIN_CFG_CYCLE_GET(x) (((uint32_t)(x) & PPI_CLKPIN_CFG_CYCLE_MASK) >> PPI_CLKPIN_CFG_CYCLE_SHIFT)

/*
 * HIGH (RW)
 *
 * clock high numer
 */
#define PPI_CLKPIN_CFG_HIGH_MASK (0xF0000UL)
#define PPI_CLKPIN_CFG_HIGH_SHIFT (16U)
#define PPI_CLKPIN_CFG_HIGH_SET(x) (((uint32_t)(x) << PPI_CLKPIN_CFG_HIGH_SHIFT) & PPI_CLKPIN_CFG_HIGH_MASK)
#define PPI_CLKPIN_CFG_HIGH_GET(x) (((uint32_t)(x) & PPI_CLKPIN_CFG_HIGH_MASK) >> PPI_CLKPIN_CFG_HIGH_SHIFT)

/*
 * LOW (RW)
 *
 * clock low number
 */
#define PPI_CLKPIN_CFG_LOW_MASK (0xF00U)
#define PPI_CLKPIN_CFG_LOW_SHIFT (8U)
#define PPI_CLKPIN_CFG_LOW_SET(x) (((uint32_t)(x) << PPI_CLKPIN_CFG_LOW_SHIFT) & PPI_CLKPIN_CFG_LOW_MASK)
#define PPI_CLKPIN_CFG_LOW_GET(x) (((uint32_t)(x) & PPI_CLKPIN_CFG_LOW_MASK) >> PPI_CLKPIN_CFG_LOW_SHIFT)

/*
 * INVERT (RW)
 *
 * set to invert clock output
 */
#define PPI_CLKPIN_CFG_INVERT_MASK (0x20U)
#define PPI_CLKPIN_CFG_INVERT_SHIFT (5U)
#define PPI_CLKPIN_CFG_INVERT_SET(x) (((uint32_t)(x) << PPI_CLKPIN_CFG_INVERT_SHIFT) & PPI_CLKPIN_CFG_INVERT_MASK)
#define PPI_CLKPIN_CFG_INVERT_GET(x) (((uint32_t)(x) & PPI_CLKPIN_CFG_INVERT_MASK) >> PPI_CLKPIN_CFG_INVERT_SHIFT)

/*
 * AON (RW)
 *
 * 0:  use clk_gate in cmd sequence for whether output clock
 * 1: always enable clock output;
 */
#define PPI_CLKPIN_CFG_AON_MASK (0x2U)
#define PPI_CLKPIN_CFG_AON_SHIFT (1U)
#define PPI_CLKPIN_CFG_AON_SET(x) (((uint32_t)(x) << PPI_CLKPIN_CFG_AON_SHIFT) & PPI_CLKPIN_CFG_AON_MASK)
#define PPI_CLKPIN_CFG_AON_GET(x) (((uint32_t)(x) & PPI_CLKPIN_CFG_AON_MASK) >> PPI_CLKPIN_CFG_AON_SHIFT)

